{
  "22": "\"",
  "26045042": "Reflections Counselling Center",
  "30269125": "Helping others mature, find answers to their problems, and solve their issues",
  "32831899": "Supporting clients core personal values, strengths and vision",
  "f188d1a": "https://reflectionscounselingcenter.netlify.app/assets/images/109449469-beatitudes-piano-cinematic-sou.mp3",
  "2268ff": "Home",
  "79dabf3f": "Trauma/EMDR",
  "65e8db0": "Reflections Counseling Center",
  "4c7d2c0": "Staff",
  "3fe0efd": "Our Blogs",
  "-2a5c9f9a": "Are you ready for healing?",
  "2d8d1eac": "Lacking motivation? Depressed? Tired of arguing? Struggling with Anxiety? Sick of what Trauma got you in? Stuck? All these unpleasant issues are symptoms of something that went wrong and was left unresolved! Here at Reflections, we have a 95% success rate in solving and changing these issues to a more pleasant experience and achieving freedom from whatever stalls you in becoming a better YOU!",
  "53ffaee2": "Connect With Us",
  "2cc537a7": "Our Mission Statement",
  "123a0fbf": "Resolve/Diminish pain of God's hurting people",
  "-18e1fc68": "Bring hope and healing to individuals and families who have lost their way with themselves, God, or others",
  "29c42e16": "Extend Grace and Hope to the hurting through competent Christian Counseling",
  "-96f9759": "Facilitate the dignity and well being of our clients and families",
  "-28eee5fd": "Provide relational wholeness in families, couples, with self, and with God",
  "-52bd880f": "Learn More",
  "53ce9c8c": "Christian Faith-Based Counseling",
  "34b0b9ff": "Many people are looking for a Christian Faith-based counselor. They want someone who has successfully faced and overcome personal struggles with God's help using the Bible as the highest standard of truth. Michael earned the bachelor's degree in Theology in 1983 and has been using Bible based counseling since 1987. Michael regularly prays for God to speak through him in sessions where God's spirit heals the clients. Michael offers this type of therapy to those seeking God's help.",
  "5c724c48": "A place where your voice matters",
  "-6cc43573": "We believe everyone has a voice and should be heard! Here at Reflections, we will work with your thoughts and ideas. When needed, we can teach you skills and give you tools to present your thoughts and ideas in better ways creating a space for YOU to be heard, communicate, and build boundaries with positive solutions.",
  "-5441d2fa": "life skills impowered",
  "50a5834d": "So many are great at work but struggle with life skills at home because of the way they were raised. Abuse, neglect and abandonment leaves many with extra challenges to attend to their family's emotional needs. Our commitment at Reflections is to teach you focus and rapport building skills and offer conflict-resolution dialogues that work.",
  "-15ec34e6": "Safe & Welcoming Zone",
  "-273d1b58": "We believe in the ability of making tomorrow and our choices better! We do not look at our clients for their struggles or mistakes, we all have these issues! But what sets us apart from anyone else, is that we approach these issues our clients have/ had as an opportunity to realize, assess, and solve. We take time to listen, set plans and goals based on my training and over 35 years of experience to equip each person that walks through our doors. You can be assured of complete confidentiality as the laws provide for your safety, and your personal issues are sealed between you and your therapist unless you share it yourself with someone else.",
  "5aac7102": "life skills empowered",
  "64ece089": "Safe and Welcoming Zone",
  "29346e6e": "What Our Clients Say About Us",
  "3d503d2b": "No items found.",
  "-475b7d60": "Frequently Asked Questions",
  "-246ca39a": "How long is each session?",
  "257386af": "We offer 1 hour sessions here at Reflections.",
  "-2f65af18": "Do you take insurance?",
  "6d2d3f18": "Yes. Michael Govan takes BCBS PPO, none related to Medicare. Dr. Thomas Kelley, takes BCBS PPO, Medicare and Carelon Behavioral Health-formerly Beacon.",
  "-39f9df8e": "Do you offer discounts to clients without Insurance?",
  "29fe47": "Yes.",
  "-19896a74": "What is your fee?",
  "-35e84c30": "The initial session is $200, every hour session after is $240.",
  "-4ef5b9a1": "What is Trauma?",
  "-16635781": "Symptoms may include flashbacks, nightmares and severe anxiety, as well as uncontrollable thoughts about the event, difficulty adjusting and coping.",
  "-3248f83b": "How long will I be in therapy?",
  "3e1a82": "Every case is unique, usually the therapist has an idea after a few weeks of treatment. Each client is recommended to come weekly, in some complex cases twice per week!",
  "-19edbd7c": "What's the difference between Counselor, Therapist, Psychologist & Psychiatrist?",
  "-715507c3": "A therapist is a licensed counselor or psychologist. A psychiatrist is a medical doctor who can diagnose and prescribe medication to treat mental health disorders.",
  "-73b93c0d": "2888 E Long Lake Rd #170",
  "4d0c29e5": "Troy, MI 48085-7011",
  "-2370feea": "(248) 524-0050",
  "78a3a990": "Colors",
  "5075a5e2": "Primary",
  "-6d4381ee": "Hex: #2A1D3A",
  "-67f9cc02": "Hex: #5D3C85",
  "-6807b687": "Hex: #5C407D",
  "-6c537def": "Hex: #332D41",
  "-6ecb8c59": "Hex: #1D76D7",
  "-659ce63d": "Hex: #7119CB",
  "-4ad28a5e": "Hex: #FFFFFF",
  "46b69154": "Secondary",
  "-62133265": "Hex: #939FB4",
  "-3ff7d804": "Desktop",
  "-cacf819": "Heading H1",
  "-cacf818": "Heading H2",
  "-cacf817": "Heading H3",
  "-cacf816": "Heading H4",
  "-cacf815": "Heading H5",
  "-cacf814": "Heading H6",
  "-1bb357d1": "Hello, my name is ",
  "16b18a": "0:00",
  "7f2745d8": "Contact Me",
  "1709da29": "I’d love to hear from you!",
  "5a0ea5a1": "Thank you! Your submission has been received!",
  "-7c112e99": "Oops! Something went wrong while submitting the form.",
  "-40b0787c": "Page Not Found",
  "556d64d8": "The page you are looking for doesn't exist or has been moved",
  "6b29b517": "Go Home",
  "-11d4bbff": "Protected Page",
  "4c641ebb": "Password",
  "-f5c4b5f": "Incorrect password. Please try again.",
  "1b095b10": "Blog are Coming Soon"
}